# DimLeaderType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLeaderType Property
ParameterTypeId Class See Also
---
"Leader Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLeaderType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLeaderType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLeaderType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace